1s/ERP/Conf/Documents/Лико_ЗабраковкаОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗабраковкаОснастки</Name>
			<BasedOn>
				<xr:Item>Document.ТС_ЗаявкаНаРемонтРабочихЦентров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>//Технический реквизит, необходим хранения документа основания</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОбнаружившийБрак</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринявшийРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ДефектыОснастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДефекта</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуОснастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийКРешению</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснасткаПокупная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПерваяВыдачаОснастки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПисьмоПоРешениюОтправлено</Name>
							<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодРекламацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗабраковкаОснастки/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда	
		
		СотрудникОбнаружившийБрак = ДанныеЗаполнения.Автор;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Организация = ДанныеЗаполнения.РабочийЦентр.Лико_Площадка.Организация;
		РабочийЦентр = ДанныеЗаполнения.РабочийЦентр;
		Распоряжение = ДанныеЗаполнения.Ссылка;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Автор = ДанныеЗаполнения.Автор;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьК2ВОбъектНоменклатуры();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗаписатьК2ВОбъектНоменклатуры(Истина);
КонецПроцедуры

Процедура ЗаписатьК2ВОбъектНоменклатуры(Отмена=Ложь)

	Для каждого стр Из ЭтотОбъект.Товары Цикл
	
		ОбъектНоменклатуры = стр.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектНоменклатуры.Категория2 = ?(Отмена,Ложь,стр.К2);
		ОбъектНоменклатуры.Записать();
	КонецЦикла;
	ОбработкаСерий();

КонецПроцедуры

Процедура ОбработкаСерий() 	
	Для каждого Товар Из Товары Цикл
		Если ЗначениеЗаполнено(Товар.Серия) Тогда	
			Товар.СтатусУказанияСерий=8;
		Иначе
			Товар.СтатусУказанияСерий=7;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверим, все ли обязательные реквизиты заполнены
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Дефект) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Решение) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Серия) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Проведен Тогда
		ТЗОснастки = Ссылка.Товары.Выгрузить();
	КонецЕсли;
	
	Если НЕ ТЗОснастки = Неопределено Тогда 
		Сч = 0;
		Для каждого Строка из ТЗОснастки Цикл
			Если ЗначениеЗаполнено(Ссылка) И Строка.ПисьмоПоРешениюОтправлено И Строка.Решение <> Товары[Сч].Решение Тогда
				Товары[Сч].ПисьмоПоРешениюОтправлено = Ложь;
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры
